witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
const static struct sysmenu_item_handler sysmenu_swr_analyser_handlers[] =
	{
		{"Band SWR", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_SWR_BAND_START},
		{"HF SWR", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_SWR_HF_START},
		{"Custom SWR", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_SWR_CUSTOM_Start},
		{"Custom Begin, kHz", SYSMENU_UINT32, NULL, (uint32_t *)&TRX.SWR_CUSTOM_Begin, SYSMENU_HANDL_SWR_CUSTOM_Begin},
		{"Custom End, kHz", SYSMENU_UINT32, NULL, (uint32_t *)&TRX.SWR_CUSTOM_End, SYSMENU_HANDL_SWR_CUSTOM_End},
};

const static struct sysmenu_item_handler sysmenu_spectrum_handlers[] =
	{
		{"Spectrum START", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_SPECTRUM_Start},
		{"Begin, kHz", SYSMENU_UINT32, NULL, (uint32_t *)&TRX.SPEC_Begin, SYSMENU_HANDL_SPECTRUM_Begin},
		{"End, kHz", SYSMENU_UINT32, NULL, (uint32_t *)&TRX.SPEC_End, SYSMENU_HANDL_SPECTRUM_End},
		{"Top, dBm", SYSMENU_INT16, NULL, (uint32_t *)&TRX.SPEC_TopDBM, SYSMENU_HANDL_SPECTRUM_TopDBM},
		{"Bottom, dBm", SYSMENU_INT16, NULL, (uint32_t *)&TRX.SPEC_BottomDBM, SYSMENU_HANDL_SPECTRUM_BottomDBM},
};

const static struct sysmenu_item_handler sysmenu_wspr_handlers[] =
	{
		{"WSPR Beacon START", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_WSPR_Start},
		{"Freq offset", SYSMENU_INT16, NULL, (uint32_t *)&TRX.WSPR_FREQ_OFFSET, SYSMENU_HANDL_WSPR_FREQ_OFFSET},
		{"BAND 160m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_160, SYSMENU_HANDL_WSPR_BAND160},
		{"BAND 80m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_80, SYSMENU_HANDL_WSPR_BAND80},
		{"BAND 40m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_40, SYSMENU_HANDL_WSPR_BAND40},
		{"BAND 30m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_30, SYSMENU_HANDL_WSPR_BAND30},
		{"BAND 20m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_20, SYSMENU_HANDL_WSPR_BAND20},
		{"BAND 17m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_17, SYSMENU_HANDL_WSPR_BAND17},
		{"BAND 15m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_15, SYSMENU_HANDL_WSPR_BAND15},
		{"BAND 12m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_12, SYSMENU_HANDL_WSPR_BAND12},
		{"BAND 10m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_10, SYSMENU_HANDL_WSPR_BAND10},
		{"BAND 6m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_6, SYSMENU_HANDL_WSPR_BAND6},
		{"BAND 2m", SYSMENU_BOOLEAN, NULL, (uint32_t *)&TRX.WSPR_BANDS_2, SYSMENU_HANDL_WSPR_BAND2},
		{"", SYSMENU_INFOLINE, 0, 0},
};

const static struct sysmenu_item_handler sysmenu_services_handlers[] =
	{
		{"DX Cluster", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_DX_CLUSTER},
		{"Propagination", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_PROPAGINATION},
		{"SWR Analyzer", SYSMENU_MENU, NULL, 0, SYSMENU_HANDL_SWR_ANALYSER_MENU},
		{"Spectrum Analyzer", SYSMENU_MENU, NULL, 0, SYSMENU_HANDL_SPECTRUMMENU},
		{"RDA Statistics", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_RDA_STATS},
		{"WSPR Beacon", SYSMENU_MENU, NULL, 0, SYSMENU_HANDL_WSPRMENU},
		{"File Manager", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_FILEMANAGER},
		{"Record CQ message", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_RECORD_CQ_WAV},
#if FT8_SUPPORT
		{"FT-8 Decoder", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_FT8_Decoder},		//Tisho
#endif
#ifdef SWR_AD8307_LOG
		{"SWR Tandem Match Contr.", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_SWR_Tandem_Ctrl}, //Tisho
#endif
#ifdef LAY_800x480
		{"Locator info", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_LOCATOR_INFO},
		{"Callsign info", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_CALLSIGN_INFO},
#endif
		{"Self Test", SYSMENU_RUN, NULL, 0, SYSMENU_HANDL_SELF_TEST},
};

static struct sysmenu_menu_wrapper sysmenu_wrappers[] = {
	{ .menu_handler = sysmenu_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_trx_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_audio_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_cw_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_screen_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_decoders_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_adc_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_wifi_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_sd_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_calibration_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_swr_analyser_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_spectrum_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_wspr_handlers, .currentIndex = 0 },
	{ .menu_handler = sysmenu_services_handlers, .currentIndex = 0 },
};

//COMMON MENU
static void drawSystemMenuElement(struct sysmenu_item_handler *menuElement, bool onlyVal);
static void SYSMENU_WIFI_DrawSelectAP1Menu(bool full_redraw);
static void SYSMENU_WIFI_SelectAP1MenuMove(int8_t dir);
static void SYSMENU_WIFI_DrawAP1passwordMenu(bool full_redraw);
static void SYSMENU_WIFI_RotatePasswordChar1(int8_t dir);
static void SYSMENU_WIFI_DrawSelectAP2Menu(bool full_redraw);
static void SYSMENU_WIFI_SelectAP2MenuMove(int8_t dir);
static void SYSMENU_WIFI_DrawAP2passwordMenu(bool full_redraw);
static void SYSMENU_WIFI_RotatePasswordChar2(int8_t dir);
static void SYSMENU_WIFI_DrawSelectAP3Menu(bool full_redraw);
static void SYSMENU_WIFI_SelectAP3MenuMove(int8_t dir);
static void SYSMENU_WIFI_DrawAP3passwordMenu(bool full_redraw);
static void SYSMENU_WIFI_RotatePasswordChar3(int8_t dir);
static void SYSMENU_TRX_DrawCallsignMenu(bool full_redraw);
static void SYSMENU_TRX_RotateCallsignChar(int8_t dir);
static void SYSMENU_TRX_DrawLocatorMenu(bool full_redraw);
static void SYSMENU_TRX_RotateLocatorChar(int8_t dir);
static uint8_t SYSTMENU_getVisibleIdFromReal(uint8_t realIndex);
static uint8_t SYSTMENU_getPageFromRealIndex(uint8_t realIndex);
static void setCurrentMenuIndex(uint8_t index);
static uint8_t getCurrentMenuIndex();

static struct sysmenu_item_handler *sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_handlers[0];
static uint8_t sysmenu_item_count = sizeof(sysmenu_handlers) / sizeof(sysmenu_handlers[0]);
static uint16_t sysmenu_y = 5;
static uint8_t sysmenu_i = 0;
static bool sysmenu_onroot = true;
bool SYSMENU_hiddenmenu_enabled = false;
static bool sysmenu_services_opened = false;
static bool sysmenu_infowindow_opened = false;
static bool sysmenu_sysinfo_opened = false;
static bool sysmenu_filemanager_opened = false;
static bool sysmenu_item_selected_by_enc2 = false;
bool sysmenu_ota_opened = false;
uint8_t sysmenu_ota_opened_state = 0;
bool SYSMENU_FT8_DECODER_opened = false; //Tisho

//WIFI
static bool sysmenu_wifi_needupdate_ap = true;
static bool sysmenu_wifi_selectap1_menu_opened = false;
static bool sysmenu_wifi_selectap2_menu_opened = false;
static bool sysmenu_wifi_selectap3_menu_opened = false;
static bool sysmenu_wifi_setAP1password_menu_opened = false;
static bool sysmenu_wifi_setAP2password_menu_opened = false;
static bool sysmenu_wifi_setAP3password_menu_opened = false;
static bool sysmenu_trx_setCallsign_menu_opened = false;
static bool sysmenu_trx_setLocator_menu_opened = false;
static uint8_t sysmenu_wifi_selected_ap_index = 0;
static uint8_t sysmenu_wifi_selected_ap_password_char_index = 0;
static uint8_t sysmenu_trx_selected_callsign_char_index = 0;
static uint8_t sysmenu_trx_selected_locator_char_index = 0;

//Time menu
static bool sysmenu_timeMenuOpened = false;
static uint8_t TimeMenuSelection = 0;

//TRX MENU

