witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_TRXMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_trx_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_trx_handlers) / sizeof(sysmenu_trx_handlers[0]);
	sysmenu_onroot = false;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

void SYSMENU_TRX_RFPOWER_HOTKEY(void)
{
	SYSMENU_HANDL_TRXMENU(0);
	setCurrentMenuIndex(0);
	LCD_redraw(false);
}

void SYSMENU_TRX_STEP_HOTKEY(void)
{
	SYSMENU_HANDL_TRXMENU(0);
	setCurrentMenuIndex(7);
	if (TRX.Fast)
		setCurrentMenuIndex(8);
	LCD_redraw(false);
}

static void SYSMENU_HANDL_TRX_BandMap(int8_t direction)
{
	if (direction > 0)
		TRX.BandMapEnabled = true;
	if (direction < 0)
		TRX.BandMapEnabled = false;
}

static void SYSMENU_HANDL_TRX_ChannelMode(int8_t direction)
{
	if (direction > 0)
		TRX.ChannelMode = true;
	if (direction < 0)
		TRX.ChannelMode = false;
}

static void SYSMENU_HANDL_TRX_AutoGain(int8_t direction)
{
	if (direction > 0)
		TRX.AutoGain = true;
	if (direction < 0)
		TRX.AutoGain = false;
	FPGA_NeedSendParams = true;
}

static void SYSMENU_HANDL_TRX_RFFilters(int8_t direction)
{
	if (direction > 0)
		TRX.RF_Filters = true;
	if (direction < 0)
		TRX.RF_Filters = false;
}

static void SYSMENU_HANDL_TRX_TWO_SIGNAL_TUNE(int8_t direction)
{
	if (direction > 0)
		TRX.TWO_SIGNAL_TUNE = true;
	if (direction < 0)
		TRX.TWO_SIGNAL_TUNE = false;
}

static void SYSMENU_HANDL_TRX_RFPower(int8_t direction)
{
	if (direction > 0 || TRX.RF_Power > 0)
		TRX.RF_Power += direction;
	if (TRX.RF_Power > 100)
		TRX.RF_Power = 100;
	
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_TRX_INPUT_TYPE_MAIN(int8_t direction)
{
	if (direction > 0 || TRX.InputType_MAIN > 0)
		TRX.InputType_MAIN += direction;
	if (TRX.InputType_MAIN > 2)
		TRX.InputType_MAIN = 2;
	WM8731_TXRX_mode();
}

static void SYSMENU_HANDL_TRX_INPUT_TYPE_DIGI(int8_t direction)
{
	if (direction > 0 || TRX.InputType_DIGI > 0)
		TRX.InputType_DIGI += direction;
	if (TRX.InputType_DIGI > 2)
		TRX.InputType_DIGI = 2;
	WM8731_TXRX_mode();
}

static void SYSMENU_HANDL_TRX_DEBUG_TYPE(int8_t direction)
{
	if (direction > 0 || TRX.Debug_Type > 0)
		TRX.Debug_Type += direction;
	if (TRX.Debug_Type > 5)
		TRX.Debug_Type = 5;
}

static void SYSMENU_HANDL_TRX_SAMPLERATE_MAIN(int8_t direction)
{
	if (direction > 0 || TRX.SAMPLERATE_MAIN > 0)
		TRX.SAMPLERATE_MAIN += direction;
	if (TRX.SAMPLERATE_MAIN > 3)
		TRX.SAMPLERATE_MAIN = 3;

	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	TRX.BANDS_SAVED_SETTINGS[band].SAMPLERATE = TRX.SAMPLERATE_MAIN;
	
	FFT_Init();
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_TRX_SAMPLERATE_FM(int8_t direction)
{
	if (direction > 0 || TRX.SAMPLERATE_FM > 0)
		TRX.SAMPLERATE_FM += direction;
	if (TRX.SAMPLERATE_FM > 3)
		TRX.SAMPLERATE_FM = 3;

	FFT_Init();
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_TRX_SHIFT_INTERVAL(int8_t direction)
{
	TRX.SHIFT_INTERVAL += direction * 100;
	if (TRX.SHIFT_INTERVAL < 100)
		TRX.SHIFT_INTERVAL = 100;
	if (TRX.SHIFT_INTERVAL > 10000)
		TRX.SHIFT_INTERVAL = 10000;
}

static void SYSMENU_HANDL_TRX_SPLIT_INTERVAL(int8_t direction)
{
	TRX.SPLIT_INTERVAL += direction * 100;
	if (TRX.SPLIT_INTERVAL < 100)
		TRX.SPLIT_INTERVAL = 100;
	if (TRX.SPLIT_INTERVAL > 10000)
		TRX.SPLIT_INTERVAL = 10000;
}

static void SYSMENU_HANDL_TRX_FRQ_STEP(int8_t direction)
{
	const uint16_t freq_steps[] = {1, 10, 25, 50, 100};
	for (uint8_t i = 0; i < ARRLENTH(freq_steps); i++)
		if (TRX.FRQ_STEP == freq_steps[i])
		{
			if (direction < 0)
			{
				if (i > 0)
					TRX.FRQ_STEP = freq_steps[i - 1];
				else
					TRX.FRQ_STEP = freq_steps[0];
				return;
			}
			else
			{
				if (i < (ARRLENTH(freq_steps) - 1))
					TRX.FRQ_STEP = freq_steps[i + 1];
				else
					TRX.FRQ_STEP = freq_steps[ARRLENTH(freq_steps) - 1];
				return;
			}
		}
	TRX.FRQ_STEP = freq_steps[0];
}

static void SYSMENU_HANDL_TRX_FRQ_FAST_STEP(int8_t direction)
{
	const uint16_t freq_steps[] = {10, 25, 50, 100, 500, 1000};
	for (uint8_t i = 0; i < ARRLENTH(freq_steps); i++)
		if (TRX.FRQ_FAST_STEP == freq_steps[i])
		{
			if (direction < 0)
			{
				if (i > 0)
					TRX.FRQ_FAST_STEP = freq_steps[i - 1];
				else
					TRX.FRQ_FAST_STEP = freq_steps[0];
				return;
			}
			else
			{
				if (i < (ARRLENTH(freq_steps) - 1))
					TRX.FRQ_FAST_STEP = freq_steps[i + 1];
				else
					TRX.FRQ_FAST_STEP = freq_steps[ARRLENTH(freq_steps) - 1];
				return;
			}
		}
	TRX.FRQ_FAST_STEP = freq_steps[0];
}

static void SYSMENU_HANDL_TRX_FRQ_ENC_STEP(int8_t direction)
{
	const uint16_t freq_steps[] = {1000, 5000, 25000, 50000};
	for (uint8_t i = 0; i < ARRLENTH(freq_steps); i++)
		if (TRX.FRQ_ENC_STEP == freq_steps[i])
		{
			if (direction < 0)
			{
				if (i > 0)
					TRX.FRQ_ENC_STEP = freq_steps[i - 1];
				else
					TRX.FRQ_ENC_STEP = freq_steps[0];
				return;
			}
			else
			{
				if (i < (ARRLENTH(freq_steps) - 1))
					TRX.FRQ_ENC_STEP = freq_steps[i + 1];
				else
					TRX.FRQ_ENC_STEP = freq_steps[ARRLENTH(freq_steps) - 1];
				return;
			}
		}
	TRX.FRQ_ENC_STEP = freq_steps[0];
}

static void SYSMENU_HANDL_TRX_FRQ_ENC_FAST_STEP(int8_t direction)
{
	const uint32_t freq_steps[] = {5000, 25000, 50000, 100000, 500000};
	for (uint8_t i = 0; i < ARRLENTH(freq_steps); i++)
		if (TRX.FRQ_ENC_FAST_STEP == freq_steps[i])
		{
			if (direction < 0)
			{
				if (i > 0)
					TRX.FRQ_ENC_FAST_STEP = freq_steps[i - 1];
				else
					TRX.FRQ_ENC_FAST_STEP = freq_steps[0];
				return;
			}
			else
			{
				if (i < (ARRLENTH(freq_steps) - 1))
					TRX.FRQ_ENC_FAST_STEP = freq_steps[i + 1];
				else
					TRX.FRQ_ENC_FAST_STEP = freq_steps[ARRLENTH(freq_steps) - 1];
				return;
			}
		}
	TRX.FRQ_ENC_FAST_STEP = freq_steps[0];
}

static void SYSMENU_HANDL_TRX_FRQ_CW_STEP_DIVIDER(int8_t direction)
{
	TRX.FRQ_CW_STEP_DIVIDER += direction;
	if (TRX.FRQ_CW_STEP_DIVIDER < 1)
		TRX.FRQ_CW_STEP_DIVIDER = 1;
	if (TRX.FRQ_CW_STEP_DIVIDER > 100)
		TRX.FRQ_CW_STEP_DIVIDER = 100;
}

static void SYSMENU_HANDL_TRX_ENC_ACCELERATE(int8_t direction)
{
	if (direction > 0)
		TRX.Encoder_Accelerate = true;
	if (direction < 0)
		TRX.Encoder_Accelerate = false;
}

static void SYSMENU_HANDL_TRX_ATT_STEP(int8_t direction)
{
	TRX.ATT_STEP += direction;
	if (TRX.ATT_STEP < 1)
		TRX.ATT_STEP = 1;
	if (TRX.ATT_STEP > 15)
		TRX.ATT_STEP = 15;
}

static void SYSMENU_TRX_DrawCallsignMenu(bool full_redraw)
{
	if (full_redraw)
	{
		LCDDriver_Fill(BG_COLOR);
		LCDDriver_printText("CALLSIGN:", 5, 5, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	}

	LCDDriver_printText(TRX.CALLSIGN, 10, 37, COLOR_GREEN, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	LCDDriver_drawFastHLine(8 + sysmenu_trx_selected_callsign_char_index * 12, 54, 12, COLOR_RED);
}

static void SYSMENU_TRX_DrawLocatorMenu(bool full_redraw)
{
	if (full_redraw)
	{
		LCDDriver_Fill(BG_COLOR);
		LCDDriver_printText("LOCATOR:", 5, 5, FG_COLOR, BG_COLOR, LAYOUT->SYSMENU_FONT_SIZE);
	}

