witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
void SYSMENU_AUDIO_AGC_HOTKEY(void)
{
	SYSMENU_HANDL_AUDIOMENU(0);
	setCurrentMenuIndex(34);
	LCD_redraw(false);
}

static void SYSMENU_HANDL_AUDIO_Volume(int8_t direction)
{
	if(direction > 0 || TRX.Volume > 0)
		TRX.Volume += direction;
	if (TRX.Volume > 100)
		TRX.Volume = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR(int8_t direction)
{
	if (direction > 0 || CurrentVFO->DNR_Type > 0)
		CurrentVFO->DNR_Type += direction;
	if (CurrentVFO->DNR_Type > 2)
		CurrentVFO->DNR_Type = 2;
	
	TRX.DNR_shadow = CurrentVFO->DNR_Type;
	
	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].DNR_Type = CurrentVFO->DNR_Type;
}

static void SYSMENU_HANDL_AUDIO_AGC(int8_t direction)
{
	if (direction > 0)
		CurrentVFO->AGC = true;
	if (direction < 0)
		CurrentVFO->AGC = false;
	
	TRX.AGC_shadow = CurrentVFO->AGC;
	
	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].AGC = CurrentVFO->AGC;
}

static void SYSMENU_HANDL_AUDIO_NOISE_BLANKER(int8_t direction)
{
	if (direction > 0)
		TRX.NOISE_BLANKER = true;
	if (direction < 0)
		TRX.NOISE_BLANKER = false;
}

static void SYSMENU_HANDL_AUDIO_IFGain(int8_t direction)
{
	TRX.IF_Gain += direction;
	if (TRX.IF_Gain < 1)
		TRX.IF_Gain = 1;
	if (TRX.IF_Gain > 80)
		TRX.IF_Gain = 80;
}

static void SYSMENU_HANDL_AUDIO_AGC_GAIN_TARGET(int8_t direction)
{
	TRX.AGC_GAIN_TARGET += direction;
	if (TRX.AGC_GAIN_TARGET < -80)
		TRX.AGC_GAIN_TARGET = -80;
	if (TRX.AGC_GAIN_TARGET > -10)
		TRX.AGC_GAIN_TARGET = -10;
}

static void SYSMENU_HANDL_AUDIO_MIC_Gain(int8_t direction)
{
	TRX.MIC_GAIN += direction;
	if (TRX.MIC_GAIN < 1)
		TRX.MIC_GAIN = 1;
	if (TRX.MIC_GAIN > 20)
		TRX.MIC_GAIN = 20;
}

static void SYSMENU_HANDL_AUDIO_MIC_Boost(int8_t direction)
{
	if (direction < 0)
		TRX.MIC_Boost = false;
	if (direction > 0)
		TRX.MIC_Boost = true;
	
	//reinit codec
	WM8731_TXRX_mode();
}

static void SYSMENU_HANDL_AUDIO_DNR1_THRES(int8_t direction)
{
	TRX.DNR1_SNR_THRESHOLD += direction;
	if (TRX.DNR1_SNR_THRESHOLD < 1)
		TRX.DNR1_SNR_THRESHOLD = 1;
	if (TRX.DNR1_SNR_THRESHOLD > 100)
		TRX.DNR1_SNR_THRESHOLD = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR2_THRES(int8_t direction)
{
	TRX.DNR2_SNR_THRESHOLD += direction;
	if (TRX.DNR2_SNR_THRESHOLD < 1)
		TRX.DNR2_SNR_THRESHOLD = 1;
	if (TRX.DNR2_SNR_THRESHOLD > 100)
		TRX.DNR2_SNR_THRESHOLD = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR_AVERAGE(int8_t direction)
{
	TRX.DNR_AVERAGE += direction;
	if (TRX.DNR_AVERAGE < 1)
		TRX.DNR_AVERAGE = 1;
	if (TRX.DNR_AVERAGE > 100)
		TRX.DNR_AVERAGE = 100;
}

static void SYSMENU_HANDL_AUDIO_DNR_MINMAL(int8_t direction)
{
	TRX.DNR_MINIMAL += direction;
	if (TRX.DNR_MINIMAL < 1)
		TRX.DNR_MINIMAL = 1;
	if (TRX.DNR_MINIMAL > 100)
		TRX.DNR_MINIMAL = 100;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_LOW_SSB(int8_t direction)
{
	TRX.MIC_EQ_LOW_SSB += direction;
	if (TRX.MIC_EQ_LOW_SSB < -10)
		TRX.MIC_EQ_LOW_SSB = -10;
	if (TRX.MIC_EQ_LOW_SSB > 10)
		TRX.MIC_EQ_LOW_SSB = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_LOW_AMFM(int8_t direction)
{
	TRX.MIC_EQ_LOW_AMFM += direction;
	if (TRX.MIC_EQ_LOW_AMFM < -10)
		TRX.MIC_EQ_LOW_AMFM = -10;
	if (TRX.MIC_EQ_LOW_AMFM > 10)
		TRX.MIC_EQ_LOW_AMFM = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_MID_SSB(int8_t direction)
{
	TRX.MIC_EQ_MID_SSB += direction;
	if (TRX.MIC_EQ_MID_SSB < -10)
		TRX.MIC_EQ_MID_SSB = -10;
	if (TRX.MIC_EQ_MID_SSB > 10)
		TRX.MIC_EQ_MID_SSB = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_MID_AMFM(int8_t direction)
{
	TRX.MIC_EQ_MID_AMFM += direction;
	if (TRX.MIC_EQ_MID_AMFM < -10)
		TRX.MIC_EQ_MID_AMFM = -10;
	if (TRX.MIC_EQ_MID_AMFM > 10)
		TRX.MIC_EQ_MID_AMFM = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_HIG_SSB(int8_t direction)
{
	TRX.MIC_EQ_HIG_SSB += direction;
	if (TRX.MIC_EQ_HIG_SSB < -10)
		TRX.MIC_EQ_HIG_SSB = -10;
	if (TRX.MIC_EQ_HIG_SSB > 10)
		TRX.MIC_EQ_HIG_SSB = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_EQ_HIG_AMFM(int8_t direction)
{
	TRX.MIC_EQ_HIG_AMFM += direction;
	if (TRX.MIC_EQ_HIG_AMFM < -10)
		TRX.MIC_EQ_HIG_AMFM = -10;
	if (TRX.MIC_EQ_HIG_AMFM > 10)
		TRX.MIC_EQ_HIG_AMFM = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_REVERBER(int8_t direction)
{
	if (direction > 0 || TRX.MIC_REVERBER > 0)
		TRX.MIC_REVERBER += direction;
	if (TRX.MIC_REVERBER > (AUDIO_MAX_REVERBER_TAPS - 1))
		TRX.MIC_REVERBER = (AUDIO_MAX_REVERBER_TAPS - 1);
	NeedReinitReverber = true;
}

static void SYSMENU_HANDL_AUDIO_MIC_NOISE_GATE(int8_t direction)
{
	TRX.MIC_NOISE_GATE += direction;
	if (TRX.MIC_NOISE_GATE < -120)
		TRX.MIC_NOISE_GATE = -120;
	if (TRX.MIC_NOISE_GATE > 0)
		TRX.MIC_NOISE_GATE = 0;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_LOW(int8_t direction)
{
	TRX.RX_EQ_LOW += direction;
	if (TRX.RX_EQ_LOW < -10)
		TRX.RX_EQ_LOW = -10;
	if (TRX.RX_EQ_LOW > 10)
		TRX.RX_EQ_LOW = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_MID(int8_t direction)
{
	TRX.RX_EQ_MID += direction;
	if (TRX.RX_EQ_MID < -10)
		TRX.RX_EQ_MID = -10;
	if (TRX.RX_EQ_MID > 10)
		TRX.RX_EQ_MID = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_EQ_HIG(int8_t direction)
{
	TRX.RX_EQ_HIG += direction;
	if (TRX.RX_EQ_HIG < -10)
		TRX.RX_EQ_HIG = -10;
	if (TRX.RX_EQ_HIG > 10)
		TRX.RX_EQ_HIG = 10;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_SSB_Speed(int8_t direction)
{
	TRX.RX_AGC_SSB_speed += direction;
	if (TRX.RX_AGC_SSB_speed < 1)
		TRX.RX_AGC_SSB_speed = 1;
	if (TRX.RX_AGC_SSB_speed > 20)
		TRX.RX_AGC_SSB_speed = 20;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_CW_Speed(int8_t direction)
{
	TRX.RX_AGC_CW_speed += direction;
	if (TRX.RX_AGC_CW_speed < 1)
		TRX.RX_AGC_CW_speed = 1;
	if (TRX.RX_AGC_CW_speed > 20)
		TRX.RX_AGC_CW_speed = 20;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_Max_gain(int8_t direction)
{
	TRX.RX_AGC_Max_gain += direction;
	if (TRX.RX_AGC_Max_gain < 1)
		TRX.RX_AGC_Max_gain = 1;
	if (TRX.RX_AGC_Max_gain > 50)
		TRX.RX_AGC_Max_gain = 50;
}

static void SYSMENU_HANDL_AUDIO_RX_AGC_Hold(int8_t direction)
{
	if(TRX.RX_AGC_Hold > 0 || direction > 0)
		TRX.RX_AGC_Hold += direction * 100;
	if (TRX.RX_AGC_Hold > 5000)
		TRX.RX_AGC_Hold = 5000;
}

