witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
void SYSMENU_CW_KEYER_HOTKEY(void)
{
	SYSMENU_HANDL_CWMENU(0);
	setCurrentMenuIndex(3);
	LCD_redraw(false);
}

static void SYSMENU_HANDL_CW_Pitch(int8_t direction)
{
	TRX.CW_Pitch += direction * 10;
	if (TRX.CW_Pitch < 50)
		TRX.CW_Pitch = 50;
	if (TRX.CW_Pitch > 10000)
		TRX.CW_Pitch = 10000;
}

static void SYSMENU_HANDL_CW_Key_timeout(int8_t direction)
{
	TRX.CW_Key_timeout += direction * 50;
	if (TRX.CW_Key_timeout < 50)
		TRX.CW_Key_timeout = 50;
	if (TRX.CW_Key_timeout > 5000)
		TRX.CW_Key_timeout = 5000;
}

static void SYSMENU_HANDL_CW_Keyer(int8_t direction)
{
	if (direction > 0)
		TRX.CW_KEYER = true;
	if (direction < 0)
		TRX.CW_KEYER = false;
}

static void SYSMENU_HANDL_CW_GaussFilter(int8_t direction)
{
	if (direction > 0)
		TRX.CW_GaussFilter = true;
	if (direction < 0)
		TRX.CW_GaussFilter = false;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_CW_Keyer_WPM(int8_t direction)
{
	TRX.CW_KEYER_WPM += direction;
	if (TRX.CW_KEYER_WPM < 1)
		TRX.CW_KEYER_WPM = 1;
	if (TRX.CW_KEYER_WPM > 200)
		TRX.CW_KEYER_WPM = 200;
}

static void SYSMENU_HANDL_CW_SelfHear(int8_t direction)
{
	if (direction > 0)
		TRX.CW_SelfHear = true;
	if (direction < 0)
		TRX.CW_SelfHear = false;
}

static void SYSMENU_HANDL_CW_DotToDashRate(int8_t direction)
{
	TRX.CW_DotToDashRate += 0.01f * direction;
	if (TRX.CW_DotToDashRate < 3.0f)
		TRX.CW_DotToDashRate = 3.0f;
	if (TRX.CW_DotToDashRate > 5.0f)
		TRX.CW_DotToDashRate = 5.0f;
}

static void SYSMENU_HANDL_CW_Iambic(int8_t direction)
{
	if (direction > 0)
		TRX.CW_Iambic = true;
	if (direction < 0)
		TRX.CW_Iambic = false;
}

static void SYSMENU_HANDL_CW_Invert(int8_t direction)
{
	if (direction > 0)
		TRX.CW_Invert = true;
	if (direction < 0)
		TRX.CW_Invert = false;
}

static void SYSMENU_HANDL_CW_PTT_Type(int8_t direction)
{
	if (direction > 0 || TRX.CW_PTT_Type > 0)
		TRX.CW_PTT_Type += direction;
	if (TRX.CW_PTT_Type > 1)
		TRX.CW_PTT_Type = 1;
	
	KEYER_symbol_status = 0;
}

//SCREEN MENU

static void SYSMENU_HANDL_LCDMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_screen_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_screen_handlers) / sizeof(sysmenu_screen_handlers[0]);
	sysmenu_onroot = false;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SCREEN_FFT_Enabled(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Enabled = true;
	if (direction < 0)
		TRX.FFT_Enabled = false;
}

static void SYSMENU_HANDL_SCREEN_COLOR_THEME(int8_t direction)
{
	if (direction > 0 || TRX.ColorThemeId > 0)
		TRX.ColorThemeId += direction;
	if (TRX.ColorThemeId > (COLOR_THEMES_COUNT - 1))
		TRX.ColorThemeId = (COLOR_THEMES_COUNT - 1);

	COLOR = &COLOR_THEMES[TRX.ColorThemeId];
	FFT_Init();
	LCD_redraw(false);
}

static void SYSMENU_HANDL_SCREEN_LAYOUT_THEME(int8_t direction)
{
	if (direction > 0 || TRX.LayoutThemeId > 0)
		TRX.LayoutThemeId += direction;
	if (TRX.LayoutThemeId > (LAYOUT_THEMES_COUNT - 1))
		TRX.LayoutThemeId = (LAYOUT_THEMES_COUNT - 1);

	LAYOUT = &LAYOUT_THEMES[TRX.LayoutThemeId];
	FFT_Init();
	LCD_redraw(false);
}

static void SYSMENU_HANDL_SCREEN_FFT_Compressor(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Compressor = true;
	if (direction < 0)
		TRX.FFT_Compressor = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_Averaging(int8_t direction)
{
	TRX.FFT_Averaging += direction;
	if (TRX.FFT_Averaging < 1)
		TRX.FFT_Averaging = 1;
	if (TRX.FFT_Averaging > FFT_MAX_MEANS)
		TRX.FFT_Averaging = FFT_MAX_MEANS;
}

static void SYSMENU_HANDL_SCREEN_FFT_Window(int8_t direction)
{
	TRX.FFT_Window += direction;
	if (TRX.FFT_Window < 1)
		TRX.FFT_Window = 1;
	if (TRX.FFT_Window > 7)
		TRX.FFT_Window = 7;
	FFT_PreInit();
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_Zoom(int8_t direction)
{
	if (direction > 0)
	{
		if (TRX.FFT_Zoom == 1)
			TRX.FFT_Zoom = 2;
		else if (TRX.FFT_Zoom == 2)
			TRX.FFT_Zoom = 4;
		else if (TRX.FFT_Zoom == 4)
			TRX.FFT_Zoom = 8;
		else if (TRX.FFT_Zoom == 8)
			TRX.FFT_Zoom = 16;
	}
	else
	{
		if (TRX.FFT_Zoom == 2)
			TRX.FFT_Zoom = 1;
		else if (TRX.FFT_Zoom == 4)
			TRX.FFT_Zoom = 2;
		else if (TRX.FFT_Zoom == 8)
			TRX.FFT_Zoom = 4;
		else if (TRX.FFT_Zoom == 16)
			TRX.FFT_Zoom = 8;
	}
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_ZoomCW(int8_t direction)
{
	if (direction > 0)
	{
		if (TRX.FFT_ZoomCW == 1)
			TRX.FFT_ZoomCW = 2;
		else if (TRX.FFT_ZoomCW == 2)
			TRX.FFT_ZoomCW = 4;
		else if (TRX.FFT_ZoomCW == 4)
			TRX.FFT_ZoomCW = 8;
		else if (TRX.FFT_ZoomCW == 8)
			TRX.FFT_ZoomCW = 16;
	}
	else
	{
		if (TRX.FFT_ZoomCW == 2)
			TRX.FFT_ZoomCW = 1;
		else if (TRX.FFT_ZoomCW == 4)
			TRX.FFT_ZoomCW = 2;
		else if (TRX.FFT_ZoomCW == 8)
			TRX.FFT_ZoomCW = 4;
		else if (TRX.FFT_ZoomCW == 16)
			TRX.FFT_ZoomCW = 8;
	}
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_Height(int8_t direction)
{
	TRX.FFT_Height += direction;
	if (TRX.FFT_Height < 1)
		TRX.FFT_Height = 1;
	if (TRX.FFT_Height > 5)
		TRX.FFT_Height = 5;
	
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_Style(int8_t direction)
{
	TRX.FFT_Style += direction;
	if (TRX.FFT_Style < 1)
		TRX.FFT_Style = 1;
	if (TRX.FFT_Style > 4)
		TRX.FFT_Style = 4;
	
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_BW_Style(int8_t direction)
{
	TRX.FFT_BW_Style += direction;
	if (TRX.FFT_BW_Style < 1)
		TRX.FFT_BW_Style = 1;
	if (TRX.FFT_BW_Style > 3)
		TRX.FFT_BW_Style = 3;
	
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_Color(int8_t direction)
{
	TRX.FFT_Color += direction;
	if (TRX.FFT_Color < 1)
		TRX.FFT_Color = 1;
	if (TRX.FFT_Color > 7)
		TRX.FFT_Color = 7;
	
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_WTF_Color(int8_t direction)
{
	TRX.WTF_Color += direction;
	if (TRX.WTF_Color < 1)
		TRX.WTF_Color = 1;
	if (TRX.WTF_Color > 7)
		TRX.WTF_Color = 7;
	
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_FreqGrid(int8_t direction)
{
	TRX.FFT_FreqGrid += direction;
	if (TRX.FFT_FreqGrid < 0)
		TRX.FFT_FreqGrid = 0;
	if (TRX.FFT_FreqGrid > 3)
		TRX.FFT_FreqGrid = 3;
	
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_dBmGrid(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_dBmGrid = true;
	if (direction < 0)
		TRX.FFT_dBmGrid = false;
	
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_WTF_Moving(int8_t direction)
{
	if (direction > 0)
		TRX.WTF_Moving = true;
	if (direction < 0)
		TRX.WTF_Moving = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_DXCluster(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_DXCluster = true;
	if (direction < 0)
		TRX.FFT_DXCluster = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_DXCluster_Azimuth(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_DXCluster_Azimuth = true;
	if (direction < 0)
		TRX.FFT_DXCluster_Azimuth = false;
}

