witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_RF_GAIN_6M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_6m > 0)
		CALIBRATE.rf_out_power_6m += direction;
	if (CALIBRATE.rf_out_power_6m == 0 && direction > 0)
		CALIBRATE.rf_out_power_6m += direction;
	if (CALIBRATE.rf_out_power_6m > 300)
		CALIBRATE.rf_out_power_6m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_2M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_2m > 0)
		CALIBRATE.rf_out_power_2m += direction;
	if (CALIBRATE.rf_out_power_2m == 0 && direction > 0)
		CALIBRATE.rf_out_power_2m += direction;
	if (CALIBRATE.rf_out_power_2m > 300)
		CALIBRATE.rf_out_power_2m = 300;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
	APROC_TX_clip_gain = 1.0f;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_S_METER_HF(int8_t direction)
{
	CALIBRATE.smeter_calibration_hf += direction;
	if (CALIBRATE.smeter_calibration_hf < -50)
		CALIBRATE.smeter_calibration_hf = -50;
	if (CALIBRATE.smeter_calibration_hf > 50)
		CALIBRATE.smeter_calibration_hf = 50;
}

static void SYSMENU_HANDL_CALIB_S_METER_VHF(int8_t direction)
{
	CALIBRATE.smeter_calibration_vhf += direction;
	if (CALIBRATE.smeter_calibration_vhf < -50)
		CALIBRATE.smeter_calibration_vhf = -50;
	if (CALIBRATE.smeter_calibration_vhf > 50)
		CALIBRATE.smeter_calibration_vhf = 50;
}

static void SYSMENU_HANDL_CALIB_ADC_OFFSET(int8_t direction)
{
	CALIBRATE.adc_offset += direction;
	if (CALIBRATE.adc_offset < -500)
		CALIBRATE.adc_offset = -500;
	if (CALIBRATE.adc_offset > 500)
		CALIBRATE.adc_offset = 500;
}

static void SYSMENU_HANDL_CALIB_LPF_END(int8_t direction)
{
	CALIBRATE.RFU_LPF_END += direction * 100000;
	if (CALIBRATE.RFU_LPF_END < 1)
		CALIBRATE.RFU_LPF_END = 1;
	if (CALIBRATE.RFU_LPF_END > 999999999)
		CALIBRATE.RFU_LPF_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_0_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_0_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_0_START < 1)
		CALIBRATE.RFU_BPF_0_START = 1;
	if (CALIBRATE.RFU_BPF_0_START > 999999999)
		CALIBRATE.RFU_BPF_0_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_0_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_0_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_0_END < 1)
		CALIBRATE.RFU_BPF_0_END = 1;
	if (CALIBRATE.RFU_BPF_0_END > 999999999)
		CALIBRATE.RFU_BPF_0_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_1_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_1_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_1_START < 1)
		CALIBRATE.RFU_BPF_1_START = 1;
	if (CALIBRATE.RFU_BPF_1_START > 999999999)
		CALIBRATE.RFU_BPF_1_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_1_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_1_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_1_END < 1)
		CALIBRATE.RFU_BPF_1_END = 1;
	if (CALIBRATE.RFU_BPF_1_END > 999999999)
		CALIBRATE.RFU_BPF_1_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_2_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_2_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_2_START < 1)
		CALIBRATE.RFU_BPF_2_START = 1;
	if (CALIBRATE.RFU_BPF_2_START > 999999999)
		CALIBRATE.RFU_BPF_2_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_2_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_2_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_2_END < 1)
		CALIBRATE.RFU_BPF_2_END = 1;
	if (CALIBRATE.RFU_BPF_2_END > 999999999)
		CALIBRATE.RFU_BPF_2_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_3_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_3_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_3_START < 1)
		CALIBRATE.RFU_BPF_3_START = 1;
	if (CALIBRATE.RFU_BPF_3_START > 999999999)
		CALIBRATE.RFU_BPF_3_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_3_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_3_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_3_END < 1)
		CALIBRATE.RFU_BPF_3_END = 1;
	if (CALIBRATE.RFU_BPF_3_END > 999999999)
		CALIBRATE.RFU_BPF_3_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_4_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_4_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_4_START < 1)
		CALIBRATE.RFU_BPF_4_START = 1;
	if (CALIBRATE.RFU_BPF_4_START > 999999999)
		CALIBRATE.RFU_BPF_4_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_4_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_4_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_4_END < 1)
		CALIBRATE.RFU_BPF_4_END = 1;
	if (CALIBRATE.RFU_BPF_4_END > 999999999)
		CALIBRATE.RFU_BPF_4_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_5_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_5_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_5_START < 1)
		CALIBRATE.RFU_BPF_5_START = 1;
	if (CALIBRATE.RFU_BPF_5_START > 999999999)
		CALIBRATE.RFU_BPF_5_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_5_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_5_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_5_END < 1)
		CALIBRATE.RFU_BPF_5_END = 1;
	if (CALIBRATE.RFU_BPF_5_END > 999999999)
		CALIBRATE.RFU_BPF_5_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_6_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_6_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_6_START < 1)
		CALIBRATE.RFU_BPF_6_START = 1;
	if (CALIBRATE.RFU_BPF_6_START > 999999999)
		CALIBRATE.RFU_BPF_6_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_6_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_6_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_6_END < 1)
		CALIBRATE.RFU_BPF_6_END = 1;
	if (CALIBRATE.RFU_BPF_6_END > 999999999)
		CALIBRATE.RFU_BPF_6_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_7_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_7_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_7_START < 1)
		CALIBRATE.RFU_BPF_7_START = 1;
	if (CALIBRATE.RFU_BPF_7_START > 999999999)
		CALIBRATE.RFU_BPF_7_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_7_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_7_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_7_END < 1)
		CALIBRATE.RFU_BPF_7_END = 1;
	if (CALIBRATE.RFU_BPF_7_END > 999999999)
		CALIBRATE.RFU_BPF_7_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_8_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_8_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_8_START < 1)
		CALIBRATE.RFU_BPF_8_START = 1;
	if (CALIBRATE.RFU_BPF_8_START > 999999999)
		CALIBRATE.RFU_BPF_8_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_8_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_8_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_8_END < 1)
		CALIBRATE.RFU_BPF_8_END = 1;
	if (CALIBRATE.RFU_BPF_8_END > 999999999)
		CALIBRATE.RFU_BPF_8_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_HPF_START(int8_t direction)
{
	CALIBRATE.RFU_HPF_START += direction * 100000;
	if (CALIBRATE.RFU_HPF_START < 1)
		CALIBRATE.RFU_HPF_START = 1;
	if (CALIBRATE.RFU_HPF_START > 999999999)
		CALIBRATE.RFU_HPF_START = 999999999;
}

