witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_SWR_FWD_RATE_HF(int8_t direction)
{
	CALIBRATE.SWR_FWD_Calibration_HF += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_FWD_Calibration_HF < 1.0f)
		CALIBRATE.SWR_FWD_Calibration_HF = 1.0f;
	if (CALIBRATE.SWR_FWD_Calibration_HF > 200.0f)
		CALIBRATE.SWR_FWD_Calibration_HF = 200.0f;
}

static void SYSMENU_HANDL_CALIB_SWR_REF_RATE_HF(int8_t direction)
{
	CALIBRATE.SWR_REF_Calibration_HF += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_REF_Calibration_HF < 1.0f)
		CALIBRATE.SWR_REF_Calibration_HF = 1.0f;
	if (CALIBRATE.SWR_REF_Calibration_HF > 200.0f)
		CALIBRATE.SWR_REF_Calibration_HF = 200.0f;
}

static void SYSMENU_HANDL_CALIB_SWR_FWD_RATE_6M(int8_t direction)
{
	CALIBRATE.SWR_FWD_Calibration_6M += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_FWD_Calibration_6M < 1.0f)
		CALIBRATE.SWR_FWD_Calibration_6M = 1.0f;
	if (CALIBRATE.SWR_FWD_Calibration_6M > 200.0f)
		CALIBRATE.SWR_FWD_Calibration_6M = 200.0f;
}

static void SYSMENU_HANDL_CALIB_SWR_REF_RATE_6M(int8_t direction)
{
	CALIBRATE.SWR_REF_Calibration_6M += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_REF_Calibration_6M < 1.0f)
		CALIBRATE.SWR_REF_Calibration_6M = 1.0f;
	if (CALIBRATE.SWR_REF_Calibration_6M > 200.0f)
		CALIBRATE.SWR_REF_Calibration_6M = 200.0f;
}

static void SYSMENU_HANDL_CALIB_SWR_FWD_RATE_VHF(int8_t direction)
{
	CALIBRATE.SWR_FWD_Calibration_VHF += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_FWD_Calibration_VHF < 1.0f)
		CALIBRATE.SWR_FWD_Calibration_VHF = 1.0f;
	if (CALIBRATE.SWR_FWD_Calibration_VHF > 200.0f)
		CALIBRATE.SWR_FWD_Calibration_VHF = 200.0f;
}

static void SYSMENU_HANDL_CALIB_SWR_REF_RATE_VHF(int8_t direction)
{
	CALIBRATE.SWR_REF_Calibration_VHF += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_REF_Calibration_VHF < 1.0f)
		CALIBRATE.SWR_REF_Calibration_VHF = 1.0f;
	if (CALIBRATE.SWR_REF_Calibration_VHF > 200.0f)
		CALIBRATE.SWR_REF_Calibration_VHF = 200.0f;
}

static void SYSMENU_HANDL_CALIB_MAX_RF_POWER(int8_t direction)
{
	CALIBRATE.MAX_RF_POWER += direction;
	if (CALIBRATE.MAX_RF_POWER < 5)
		CALIBRATE.MAX_RF_POWER = 5;
	if (CALIBRATE.MAX_RF_POWER > 200)
		CALIBRATE.MAX_RF_POWER = 200;
}

static void SYSMENU_HANDL_CALIB_VCXO(int8_t direction)
{
	CALIBRATE.VCXO_correction += direction;
	if (CALIBRATE.VCXO_correction < -100)
		CALIBRATE.VCXO_correction = -100;
	if (CALIBRATE.VCXO_correction > 100)
		CALIBRATE.VCXO_correction = 100;
}
//Tisho
static void SYSMENU_HANDL_CALIB_FW_AD8307_SLP(int8_t direction)
{
	CALIBRATE.FW_AD8307_SLP += (float32_t)direction * 0.1f;
	if (CALIBRATE.FW_AD8307_SLP < 20.0f)
		CALIBRATE.FW_AD8307_SLP = 20.0f;
	if (CALIBRATE.FW_AD8307_SLP > 30.0f)
		CALIBRATE.FW_AD8307_SLP = 30.0f;
}

static void SYSMENU_HANDL_CALIB_FW_AD8307_OFFS(int8_t direction)
{
	CALIBRATE.FW_AD8307_OFFS += (float32_t)direction;
	if (CALIBRATE.FW_AD8307_OFFS < 0.1f)
		CALIBRATE.FW_AD8307_OFFS = 0.1f;
	if (CALIBRATE.FW_AD8307_OFFS > 4000.0f)
		CALIBRATE.FW_AD8307_OFFS = 4000.0f;
}

static void SYSMENU_HANDL_CALIB_BW_AD8307_SLP(int8_t direction)
{
	CALIBRATE.BW_AD8307_SLP += (float32_t)direction * 0.1f;
	if (CALIBRATE.BW_AD8307_SLP < 20.0f)
		CALIBRATE.BW_AD8307_SLP = 20.0f;
	if (CALIBRATE.BW_AD8307_SLP > 30.0f)
		CALIBRATE.BW_AD8307_SLP = 30.0f;
}

static void SYSMENU_HANDL_CALIB_BW_AD8307_OFFS(int8_t direction)
{
	CALIBRATE.BW_AD8307_OFFS += (float32_t)direction;
	if (CALIBRATE.BW_AD8307_OFFS < 0.1f)
		CALIBRATE.BW_AD8307_OFFS = 0.1f;
	if (CALIBRATE.BW_AD8307_OFFS > 4000.0f)
		CALIBRATE.BW_AD8307_OFFS = 4000.0f;
}
//end Tisho
static void SYSMENU_HANDL_CALIB_FAN_MEDIUM_START(int8_t direction)
{
	CALIBRATE.FAN_MEDIUM_START += direction;
	if (CALIBRATE.FAN_MEDIUM_START < 10)
		CALIBRATE.FAN_MEDIUM_START = 10;
	if (CALIBRATE.FAN_MEDIUM_START > 100)
		CALIBRATE.FAN_MEDIUM_START = 100;
}

static void SYSMENU_HANDL_CALIB_FAN_MEDIUM_STOP(int8_t direction)
{
	CALIBRATE.FAN_MEDIUM_STOP += direction;
	if (CALIBRATE.FAN_MEDIUM_STOP < 10)
		CALIBRATE.FAN_MEDIUM_STOP = 10;
	if (CALIBRATE.FAN_MEDIUM_STOP > (CALIBRATE.FAN_MEDIUM_START - 1))
		CALIBRATE.FAN_MEDIUM_STOP = CALIBRATE.FAN_MEDIUM_START - 1;
}

static void SYSMENU_HANDL_CALIB_FAN_FULL_START(int8_t direction)
{
	CALIBRATE.FAN_FULL_START += direction;
	if (CALIBRATE.FAN_FULL_START < 10)
		CALIBRATE.FAN_FULL_START = 10;
	if (CALIBRATE.FAN_FULL_START > 100)
		CALIBRATE.FAN_FULL_START = 100;
}

static void SYSMENU_HANDL_CALIB_TRX_MAX_RF_TEMP(int8_t direction)
{
	CALIBRATE.TRX_MAX_RF_TEMP += direction;
	if (CALIBRATE.TRX_MAX_RF_TEMP < 30)
		CALIBRATE.TRX_MAX_RF_TEMP = 30;
	if (CALIBRATE.TRX_MAX_RF_TEMP > 120)
		CALIBRATE.TRX_MAX_RF_TEMP = 120;
}

static void SYSMENU_HANDL_CALIB_TRX_MAX_SWR(int8_t direction)
{
	CALIBRATE.TRX_MAX_SWR += direction;
	if (CALIBRATE.TRX_MAX_SWR < 2)
		CALIBRATE.TRX_MAX_SWR = 2;
	if (CALIBRATE.TRX_MAX_SWR > 50)
		CALIBRATE.TRX_MAX_SWR = 50;
}

static void SYSMENU_HANDL_CALIB_FM_DEVIATION_SCALE(int8_t direction)
{
	CALIBRATE.FM_DEVIATION_SCALE += direction;
	if (CALIBRATE.FM_DEVIATION_SCALE < 1)
		CALIBRATE.FM_DEVIATION_SCALE = 1;
	if (CALIBRATE.FM_DEVIATION_SCALE > 20)
		CALIBRATE.FM_DEVIATION_SCALE = 20;
}

static void SYSMENU_HANDL_CALIB_SSB_POWER_ADDITION(int8_t direction)
{
	if(CALIBRATE.SSB_POWER_ADDITION > 0 || direction > 0)
		CALIBRATE.SSB_POWER_ADDITION += direction;
	if (CALIBRATE.SSB_POWER_ADDITION > 90)
		CALIBRATE.SSB_POWER_ADDITION = 90;
}

static void SYSMENU_HANDL_CALIB_AM_MODULATION_INDEX(int8_t direction)
{
	CALIBRATE.AM_MODULATION_INDEX += direction;
	if (CALIBRATE.AM_MODULATION_INDEX < 1)
		CALIBRATE.AM_MODULATION_INDEX = 1;
	if (CALIBRATE.AM_MODULATION_INDEX > 150)
		CALIBRATE.AM_MODULATION_INDEX = 150;
}

static void SYSMENU_HANDL_CALIB_TUNE_MAX_POWER(int8_t direction)
{
	CALIBRATE.TUNE_MAX_POWER += direction;
	if (CALIBRATE.TUNE_MAX_POWER < 1)
		CALIBRATE.TUNE_MAX_POWER = 1;
	if (CALIBRATE.TUNE_MAX_POWER > 120)
		CALIBRATE.TUNE_MAX_POWER = 120;
	ATU_TunePowerStabilized = false;
}

static void SYSMENU_HANDL_CALIB_RTC_CALIBRATION(int8_t direction)
{
	CALIBRATE.RTC_Calibration += direction;
	if (CALIBRATE.RTC_Calibration < -511)
		CALIBRATE.RTC_Calibration = -511;
	if (CALIBRATE.RTC_Calibration > 511)
		CALIBRATE.RTC_Calibration = 511;

