witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_NOTX_15m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_15m = true;
	if (direction < 0)
		CALIBRATE.NOTX_15m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_12m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_12m = true;
	if (direction < 0)
		CALIBRATE.NOTX_12m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_CB(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_CB = true;
	if (direction < 0)
		CALIBRATE.NOTX_CB = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_10m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_10m = true;
	if (direction < 0)
		CALIBRATE.NOTX_10m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_6m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_6m = true;
	if (direction < 0)
		CALIBRATE.NOTX_6m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_2m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_2m = true;
	if (direction < 0)
		CALIBRATE.NOTX_2m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_70cm(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_70cm = true;
	if (direction < 0)
		CALIBRATE.NOTX_70cm = false;
}

static void SYSMENU_HANDL_CALIB_ENABLE_60m_band(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENABLE_60m_band = true;
	if (direction < 0)
		CALIBRATE.ENABLE_60m_band = false;
	
	BANDS[BANDID_60m].selectable = CALIBRATE.ENABLE_60m_band;
}

static void SYSMENU_HANDL_CALIB_ENABLE_marine_band(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENABLE_marine_band = true;
	if (direction < 0)
		CALIBRATE.ENABLE_marine_band = false;
	
	BANDS[BANDID_Marine].selectable = CALIBRATE.ENABLE_marine_band;
}

static void SYSMENU_HANDL_CALIB_OTA_update(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.OTA_update = true;
	if (direction < 0)
		CALIBRATE.OTA_update = false;
}

static void SYSMENU_HANDL_CALIB_TX_StartDelay(int8_t direction)
{
	if(CALIBRATE.TX_StartDelay > 0 || direction > 0)
		CALIBRATE.TX_StartDelay += direction;
	if (CALIBRATE.TX_StartDelay > 2000)
		CALIBRATE.TX_StartDelay = 2000;
}

static void SYSMENU_HANDL_CALIB_LCD_Rotate(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.LCD_Rotate = true;
	if (direction < 0)
		CALIBRATE.LCD_Rotate = false;
	
	LCD_Init();
	LCD_redraw(false);
}

static void SYSMENU_HANDL_INA226_PWR_MON(int8_t direction)
{
	if (direction > 0)
		{
		CALIBRATE.INA226_EN = true;
		INA226_Init();
		}	
	if (direction < 0)
		CALIBRATE.INA226_EN = false;
}

static void SYSMENU_HANDL_INA226_CUR_CALL(int8_t direction)
{
	CALIBRATE.INA226_CurCalc += (float32_t)direction * 0.01f;
	if (CALIBRATE.INA226_CurCalc < 0.01f)
		CALIBRATE.INA226_CurCalc = 0.01f;
	if (CALIBRATE.INA226_CurCalc > 10.0f)
		CALIBRATE.INA226_CurCalc = 10.0f;
}

static void SYSMENU_HANDL_CALIB_PWR_VLT_Calibration(int8_t direction)
{
	CALIBRATE.PWR_VLT_Calibration += (float32_t)direction * 1.0f;
	if (CALIBRATE.PWR_VLT_Calibration < 1.0f)
		CALIBRATE.PWR_VLT_Calibration = 1.0f;
	if (CALIBRATE.PWR_VLT_Calibration > 1500.0f)
		CALIBRATE.PWR_VLT_Calibration = 1500.0f;
}

static void SYSMENU_HANDL_CALIB_ATU_AVERAGING(int8_t direction)
{
	if(CALIBRATE.ATU_AVERAGING > 0 || direction > 0)
		CALIBRATE.ATU_AVERAGING += direction;
	if (CALIBRATE.ATU_AVERAGING > 15)
		CALIBRATE.ATU_AVERAGING = 15;
}

static void SYSMENU_HANDL_CALIB_CAT_Type(int8_t direction)
{
	if(CALIBRATE.CAT_Type > 0 || direction > 0)
		CALIBRATE.CAT_Type += direction;
	if (CALIBRATE.CAT_Type > 1)
		CALIBRATE.CAT_Type = 1;
}

//SERVICES
void SYSMENU_HANDL_SERVICESMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_services_opened = true;
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_services_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_services_handlers) / sizeof(sysmenu_services_handlers[0]);
	sysmenu_onroot = false;
	//drawSystemMenu(true);
	LCD_redraw(false);
}

//SWR ANALYZER
static void SYSMENU_HANDL_SWR_ANALYSER_MENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_swr_analyser_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_swr_analyser_handlers) / sizeof(sysmenu_swr_analyser_handlers[0]);
	sysmenu_onroot = false;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SWR_CUSTOM_Start(int8_t direction)
{
	if (SYSMENU_swr_opened)
	{
		SWR_EncRotate(direction);
	}
	else
	{
		SYSMENU_swr_opened = true;
		SWR_Start(TRX.SWR_CUSTOM_Begin * 1000, TRX.SWR_CUSTOM_End * 1000);
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

static void SYSMENU_HANDL_SWR_CUSTOM_Begin(int8_t direction)
{
	TRX.SWR_CUSTOM_Begin += direction * 100;
	if (TRX.SWR_CUSTOM_Begin < 100)
		TRX.SWR_CUSTOM_Begin = 100;
}

static void SYSMENU_HANDL_SWR_CUSTOM_End(int8_t direction)
{
	TRX.SWR_CUSTOM_End += direction * 100;
	if (TRX.SWR_CUSTOM_End < 100)
		TRX.SWR_CUSTOM_End = 100;
}

//SWR BAND ANALYZER
static void SYSMENU_HANDL_SWR_BAND_START(int8_t direction)
{
	if (SYSMENU_swr_opened)
	{
		SWR_EncRotate(direction);
	}
	else
	{
		SYSMENU_swr_opened = true;
		int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
		SWR_Start(BANDS[band].startFreq - 100000, BANDS[band].endFreq + 100000);
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

//SWR HF ANALYZER
static void SYSMENU_HANDL_SWR_HF_START(int8_t direction)
{
	if (SYSMENU_swr_opened)
	{
		SWR_EncRotate(direction);
	}
	else
	{
		SYSMENU_swr_opened = true;
		SWR_Start(1000000, 60000000);
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

//SPECTRUM ANALYZER
static void SYSMENU_HANDL_SPECTRUMMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_spectrum_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_spectrum_handlers) / sizeof(sysmenu_spectrum_handlers[0]);
	sysmenu_onroot = false;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SPECTRUM_Start(int8_t direction)
{
	if (SYSMENU_spectrum_opened)
	{
		SPEC_EncRotate(direction);
	}
	else
	{
		SYSMENU_spectrum_opened = true;
		SPEC_Start();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

static void SYSMENU_HANDL_SPECTRUM_Begin(int8_t direction)
{
	TRX.SPEC_Begin += direction * 100;
	if (TRX.SPEC_Begin < 100)
		TRX.SPEC_Begin = 100;
}

